tutorials/incompressible/simpleSolver/laminar/ACCM_teeJunction/0/p
/*------------------------------------------------------------------------------*
Caelus 8.04
Web:   www.caelus-cml.com
\*-----------------------------------------------------------------------------*/
FoamFile
{
	version				2.0;
	format				ascii;
	class				volScalarField;
	location			"0";
	object				p;
}

//-------------------------------------------------------------------------------

dimensions				[0 2 -2 0 0 0 0];

internalField				uniform 0;

boundaryField
{
	wall
	{
		type			zeroGradient;
	}
	inlet
	{
		type			zeroGradient;
	}
	outlet-1
	{
		type			fixedValue;
		value			uniform	0;
	}
	outlet-2
	{
		type			fixedValue;
		value			uniform 0;
	}
	symm-left-right
	{
		type			empty;
	}
}
