tutorials/incompressible/simpleSolver/laminar/ACCM_teeJunction/constant/turbulenceProperties
/*-----------------------------------------------------------------------------*
Caelus 8.04
Web:   www.caelus-cml.com
\*-----------------------------------------------------------------------------*/
FoamFile
{

	version				2.0;
	format				ascii;
	class				dictionary;
	location			"constant";
	object				turbulenceProperties;
}

//-----------------------------------------------------------------------------

simulationType			laminar;
