tutorials/incompressible/simpleSolver/laminar/ACCM_teeJunction/system/fvSolution
/*-------------------------------------------------------------------------------*
Caelus 8.04
Web:   www.caelus-cml.com
\*------------------------------------------------------------------------------*/
FoamFile
{
        version                         2.0;
        format                          ascii;
        class                           dictionary;
        location                        "system";
        object                          fvSolution;
}

//------------------------------------------------------------------------------

solvers
{
        p
        {
                solver                  PCG;
                preconditioner          SSGS;
                tolerance               1e-8;
                relTol                  0.01;
        }
        U
        {
                solver                  PBiCGStab;
                preconditioner          USGS;
                tolerance               1e-7;
                relTol                  0.01;
        }

}

SIMPLE
{
        nNonOrthogonalCorrectors        0;
        pRefCell                        0;
        pRefValue                       0;
        consistent  true;
}

// relexation factors

relaxationFactors
{
        p                               1.0;
        U                               0.7;
}
